In [1]:
import pandas as pd
import numpy as np

df= pd.DataFrame({
    "메뉴": ["아메리카노", "카페라떼", "에스프레소", "카페모카", "바닐라라떼"], 
    "가격": [4500, 5000, 4000, 5900, 5300], 
    "칼로리": [10, 110, np.nan, 210, np.nan],
    "원두": ["과테말라", "브라질", "과테말라", np.nan, np.nan]
})

df

      메뉴    가격    칼로리    원두
0  아메리카노  4500   10.0  과테말라
1   카페라떼  5000  110.0   브라질
2  에스프레소  4000    NaN  과테말라
3   카페모카  5900  210.0   NaN
4  바닐라라떼  5300    NaN   NaN

In [2]:
#1. 칼로리 컬럼의 결측치를 칼로리 데이터 중 최솟값을 채우시오 
#2. 원두 컬럼의 켤측치를 원산지 데이터 중 최빈값을 채우시오 
#3. 가격이 15,000원 이상인 데이터 수를 구하시오 
#4. "이벤트가" 컬럼을 만들고 기존 가격에서 50% 할인된 가격을 채우시오
#5. "칼로리" 컬럼을 삭제하시오

In [3]:
#6. 위에서부터 3개의 행만 선택하시오(loc사용)
#7. 위에서부터 3개의 행만 선택하시오(iloc사용)
#8. 주어진 데이터에서 아래 값을 loc를 활용해 데이터프레임으로 출력하시오 
#    * 카페라떼 5000
#    * 에스프레소 4000 
#9. 주어진 데이터(df)에서 아래 값을 iloc를 활용해 데이터프레임으로 출력하시오 
#    * 카페라떼 5000
#    * 에스프레소 4000 
#10. 메뉴 중 가격이 가장 비싼 순으로 정렬해 3개의 값을 구하시오

In [4]:
#1. 칼로리 컬럼의 결측치를 칼로리 데이터 중 최솟값을 채우시오
cal_min = df["칼로리"].min()
cal_min

df["칼로리"]= df["칼로리"].fillna(cal_min)
df

      메뉴    가격    칼로리    원두
0  아메리카노  4500   10.0  과테말라
1   카페라떼  5000  110.0   브라질
2  에스프레소  4000   10.0  과테말라
3   카페모카  5900  210.0   NaN
4  바닐라라떼  5300   10.0   NaN

In [5]:
#2. 원두 컬럼의 켤측치를 원산지 데이터 중 최빈값을 채우시오 
# df["원두"].isnull().sum()
origin_mode = df["원두"].mode()[0]
print(origin_mode)

df["원두"] = df["원두"].fillna(origin_mode)
df

과테말라

      메뉴    가격    칼로리    원두
0  아메리카노  4500   10.0  과테말라
1   카페라떼  5000  110.0   브라질
2  에스프레소  4000   10.0  과테말라
3   카페모카  5900  210.0  과테말라
4  바닐라라떼  5300   10.0  과테말라

In [6]:
#3. 가격이 15,000원 이상인 데이터 수를 구하시오 

cond = df["가격"] >= 15000
sum(cond)

0

In [7]:
#4. "이벤트가" 컬럼을 만들고 기존 가격에서 50% 할인된 가격을 채우시오

df["이벤트가"] = df["가격"] * 0.5
df

      메뉴    가격    칼로리    원두    이벤트가
0  아메리카노  4500   10.0  과테말라  2250.0
1   카페라떼  5000  110.0   브라질  2500.0
2  에스프레소  4000   10.0  과테말라  2000.0
3   카페모카  5900  210.0  과테말라  2950.0
4  바닐라라떼  5300   10.0  과테말라  2650.0

In [8]:
#5. "칼로리" 컬럼을 삭제하시오 
df

      메뉴    가격    칼로리    원두    이벤트가
0  아메리카노  4500   10.0  과테말라  2250.0
1   카페라떼  5000  110.0   브라질  2500.0
2  에스프레소  4000   10.0  과테말라  2000.0
3   카페모카  5900  210.0  과테말라  2950.0
4  바닐라라떼  5300   10.0  과테말라  2650.0

In [9]:
df.drop("칼로리", axis=1, inplace=True)
df

      메뉴    가격    원두    이벤트가
0  아메리카노  4500  과테말라  2250.0
1   카페라떼  5000   브라질  2500.0
2  에스프레소  4000  과테말라  2000.0
3   카페모카  5900  과테말라  2950.0
4  바닐라라떼  5300  과테말라  2650.0

In [10]:
#6. 위에서부터 3개의 행만 선택하시오(loc사용)
df.loc[0:2]

      메뉴    가격    원두    이벤트가
0  아메리카노  4500  과테말라  2250.0
1   카페라떼  5000   브라질  2500.0
2  에스프레소  4000  과테말라  2000.0

In [11]:
#7. 위에서부터 3개의 행만 선택하시오(iloc사용)
df.iloc[0:3]

      메뉴    가격    원두    이벤트가
0  아메리카노  4500  과테말라  2250.0
1   카페라떼  5000   브라질  2500.0
2  에스프레소  4000  과테말라  2000.0

In [12]:
#8. 주어진 데이터에서 아래 값을 loc를 활용해 데이터프레임으로 출력하시오 
#    * 카페라떼 5000
#    * 에스프레소 4000 
df.loc[1:2, "메뉴":"가격"]

      메뉴    가격
1   카페라떼  5000
2  에스프레소  4000

In [13]:
#9. 주어진 데이터(df)에서 아래 값을 iloc를 활용해 데이터프레임으로 출력하시오 
#    * 카페라떼 5000
#    * 에스프레소 4000 
df.iloc[1:3,0:2]

      메뉴    가격
1   카페라떼  5000
2  에스프레소  4000

In [18]:
#10. 메뉴 중 가격이 가장 비싼 순으로 정렬해 3개의 값을 구하시오
df.sort_values(by='가격', ascending=False).head(3)

      메뉴    가격    원두    이벤트가
3   카페모카  5900  과테말라  2950.0
4  바닐라라떼  5300  과테말라  2650.0
1   카페라떼  5000   브라질  2500.0

In [15]:
df.nlargest(3,'가격')

      메뉴    가격    원두    이벤트가
3   카페모카  5900  과테말라  2950.0
4  바닐라라떼  5300  과테말라  2650.0
1   카페라떼  5000   브라질  2500.0